In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [4]:
df = pd.read_csv('FoodPrice_in_Turkey.csv')
df.head()

,Place,ProductId,ProductName,UmId,UmName,Month,Year,Price
0,National Average,52,Rice - Retail,5,KG,5,2013,4.4920
1,National Average,52,Rice - Retail,5,KG,6,2013,4.5786
2,National Average,52,Rice - Retail,5,KG,11,2013,4.7865
3,National Average,52,Rice - Retail,5,KG,12,2013,5.1337
4,National Average,52,Rice - Retail,5,KG,1,2014,5.5099

In [7]:
df.shape
# bộ dữ liệu chứa 7381 dòng và 8 cột

(7381, 8)

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7381 entries, 0 to 7380
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Place        7381 non-null   object
 1   ProductId    7381 non-null   int64
 2   ProductName  7381 non-null   object
 3   UmId         7381 non-null   int64
 4   UmName       7381 non-null   object
 5   Month        7381 non-null   int64
 6   Year         7381 non-null   int64
 7   Price        7381 non-null   float64
dtypes: float64(1), int64(4), object(3)
memory usage: 461.4+ KB

In [14]:
# Thang đo tương ứng của các thuộc tính được lưu trữ
# Place, ProductId, ProductName, UmName, month, year thuộc thang đo norminal
# Umld và price thuộc thang ratio

In [23]:
df1 = df.groupby(['ProductName','Year']).agg({'Price': ['mean', 'median']}).reset_index()

In [24]:
df1

               ProductName  Year     Price
                                      mean   median
0    Apples (red) - Retail  2013  2.080950  2.05110
1    Apples (red) - Retail  2014  2.410118  2.36800
2    Apples (red) - Retail  2015  2.401417  2.38000
3    Apples (red) - Retail  2016  2.428333  2.35500
4    Apples (red) - Retail  2017  2.560000  2.52000
..                     ...   ...       ...      ...
295        Yogurt - Retail  2018  5.804490  5.73030
296        Yogurt - Retail  2019  5.956696  5.93860
297      Zucchini - Retail  2017  3.477094  2.69810
298      Zucchini - Retail  2018  3.656315  3.46500
299      Zucchini - Retail  2019  4.288779  3.84335

[300 rows x 4 columns]

In [5]:
# Bạn đề xuất tất cả các yêu cầu phân tích, hiện tại bạn chưa làm được, nhưng hãy chúng ta sẽ giải quyết ở các bài học sau
# Sản phẩm có giá cao thứ 2 trong tháng 3 năm 2016